Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/atdf/ATSAMS70Q20.atdf
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD9" function="C" group="ADTRG"/>
              <signal pad="PB1" function="X1" group="AD" index="0"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
              <signal pad="PC13" function="X1" group="AD" index="1"/>
              <signal pad="PC15" function="X1" group="AD" index="2"/>
              <signal pad="PC12" function="X1" group="AD" index="3"/>
              <signal pad="PC29" function="X1" group="AD" index="4"/>
              <signal pad="PC30" function="X1" group="AD" index="5"/>
              <signal pad="PC31" function="X1" group="AD" index="6"/>
              <signal pad="PC26" function="X1" group="AD" index="7"/>
              <signal pad="PC27" function="X1" group="AD" index="8"/>
              <signal pad="PC0" function="X1" group="AD" index="9"/>
              <signal pad="PE3" function="X1" group="AD" index="10"/>
              <signal pad="PE0" function="X1" group="AD" index="11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="INSTANCE_ID" value="40"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZC">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" id="11246" version="D">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD0" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="30"/>
              <param name="INSTANCE_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="EFC" id="6450" version="X">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="H">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="HSMCI" id="6449" version="Q">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA25" function="D" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="0"/>
              <param name="DMAC_ID_TX" value="0"/>
              <param name="INSTANCE_ID" value="18"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="11105" version="F">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="ISI" id="6350" version="I">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0x4004C000"/>
            <signals>
              <signal pad="PD22" function="D" group="D" index="0"/>
              <signal pad="PD21" function="D" group="D" index="1"/>
              <signal pad="PB3" function="D" group="D" index="2"/>
              <signal pad="PA9" function="B" group="D" index="3"/>
              <signal pad="PA5" function="B" group="D" index="4"/>
              <signal pad="PD11" function="D" group="D" index="5"/>
              <signal pad="PD12" function="D" group="D" index="6"/>
              <signal pad="PA27" function="D" group="D" index="7"/>
              <signal pad="PD27" function="D" group="D" index="8"/>
              <signal pad="PD28" function="D" group="D" index="9"/>
              <signal pad="PD30" function="D" group="D" index="10"/>
              <signal pad="PD31" function="D" group="D" index="11"/>
              <signal pad="PD24" function="D" group="HSYNC"/>
              <signal pad="PA24" function="D" group="PCK"/>
              <signal pad="PD25" function="D" group="VSYNC"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11282" version="G">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x40088000"/>
          </instance>
        </module>
        <module name="PIO" id="11004" version="U">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA0"/>
              <signal group="P" index="1" function="default" pad="PA1"/>
              <signal group="P" index="2" function="default" pad="PA2"/>
              <signal group="P" index="3" function="default" pad="PA3"/>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="29" function="default" pad="PA29"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="34"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
            <signals>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="33" function="default" pad="PB1"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="37" function="default" pad="PB5"/>
              <signal group="P" index="38" function="default" pad="PB6"/>
              <signal group="P" index="39" function="default" pad="PB7"/>
              <signal group="P" index="40" function="default" pad="PB8"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
